In [1]:
import pandas as pd

In [2]:
#data below is a stringified table where delimiter is ';' and line_terminator is '\n'.
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21, 40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78, 66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'

Requirements
Please create a new table with the following transformations on the above command separated data:

1. FlightCodes column: Some values are null. Flight Codes are supposed to increase by 10 with each row so 1010 and 1030 will have 1020 in the middle. Fill in these missing numbers and make the column an integer column (instead of a float column).

2. To_From column: Should be split into two separate columns for better analysis! Split on '_' to create two new columns respectively. 
Also, the case of the column is not very readable, convert the column into capital case.

3. Airline Code column: Clean the Airline Codes to have no punctuation except spaces in the middle. E.g. '(Porter Airways. )' should become 'Porter Airways'.

In [3]:
# Split the data into rows
rows = data.strip().split('\n')
print(rows)

['Airline Code;DelayTimes;FlightCodes;To_From', 'Air Canada (!);[21, 40];20015.0;WAterLoo_NEWYork', '<Air France> (12);[];;Montreal_TORONTO', '(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa', '12. Air France;[78, 66];;Ottawa_VANcouvER', '""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal']

In [4]:
# Split each row into columns
columns = [row.split(';') for row in rows]
print(columns)

[['Airline Code', 'DelayTimes', 'FlightCodes', 'To_From'], ['Air Canada (!)', '[21, 40]', '20015.0', 'WAterLoo_NEWYork'], ['<Air France> (12)', '[]', '', 'Montreal_TORONTO'], ['(Porter Airways. )', '[60, 22, 87]', '20035.0', 'CALgary_Ottawa'], ['12. Air France', '[78, 66]', '', 'Ottawa_VANcouvER'], ['""".\\.Lufthansa.\\."""', '[12, 33]', '20055.0', 'london_MONTreal']]

In [5]:
# Create a pandas DataFrame from the columns
df = pd.DataFrame(columns)
df.columns = df.iloc[0]
df = df[1:]
print(df.columns)

Index(['Airline Code', 'DelayTimes', 'FlightCodes', 'To_From'], dtype='object', name=0)

In [6]:
df.head()

0           Airline Code    DelayTimes FlightCodes           To_From
1         Air Canada (!)      [21, 40]     20015.0  WAterLoo_NEWYork
2      <Air France> (12)            []              Montreal_TORONTO
3     (Porter Airways. )  [60, 22, 87]     20035.0    CALgary_Ottawa
4         12. Air France      [78, 66]              Ottawa_VANcouvER
5  """.\.Lufthansa.\."""      [12, 33]     20055.0   london_MONTreal

In [7]:
# Convert FlightCodes to numeric
df['FlightCodes'] = pd.to_numeric(df['FlightCodes'], errors='coerce')

# Identify missing values and set them to the previous value plus 10
missing_mask = df['FlightCodes'].isna()
df['FlightCodes'] = df['FlightCodes'].ffill() + 10 * missing_mask

# Convert to integer
df['FlightCodes'] = df['FlightCodes'].astype(int)

In [8]:
df.head()

0           Airline Code    DelayTimes  FlightCodes           To_From
1         Air Canada (!)      [21, 40]        20015  WAterLoo_NEWYork
2      <Air France> (12)            []        20025  Montreal_TORONTO
3     (Porter Airways. )  [60, 22, 87]        20035    CALgary_Ottawa
4         12. Air France      [78, 66]        20045  Ottawa_VANcouvER
5  """.\.Lufthansa.\."""      [12, 33]        20055   london_MONTreal

In [9]:
# Split To_From column into two separate columns
df[['To', 'From']] = df['To_From'].str.split('_', expand=True)

#convert to capital case
df['To'] = df['To'].str.upper()
df['From'] = df['From'].str.upper()

# Drop the original To_From column
df.drop('To_From', axis=1, inplace=True)

In [10]:
df.head()

0           Airline Code    DelayTimes  FlightCodes        To       From
1         Air Canada (!)      [21, 40]        20015  WATERLOO    NEWYORK
2      <Air France> (12)            []        20025  MONTREAL    TORONTO
3     (Porter Airways. )  [60, 22, 87]        20035   CALGARY     OTTAWA
4         12. Air France      [78, 66]        20045    OTTAWA  VANCOUVER
5  """.\.Lufthansa.\."""      [12, 33]        20055    LONDON   MONTREAL

In [11]:
# Clean the Airline Code column
df['Airline Code'] = df['Airline Code'].str.replace('[^a-zA-Z ]', '', regex=True)
df.head()

0     Airline Code    DelayTimes  FlightCodes        To       From
1      Air Canada       [21, 40]        20015  WATERLOO    NEWYORK
2      Air France             []        20025  MONTREAL    TORONTO
3  Porter Airways   [60, 22, 87]        20035   CALGARY     OTTAWA
4       Air France      [78, 66]        20045    OTTAWA  VANCOUVER
5        Lufthansa      [12, 33]        20055    LONDON   MONTREAL

In [12]:
df.head()

0     Airline Code    DelayTimes  FlightCodes        To       From
1      Air Canada       [21, 40]        20015  WATERLOO    NEWYORK
2      Air France             []        20025  MONTREAL    TORONTO
3  Porter Airways   [60, 22, 87]        20035   CALGARY     OTTAWA
4       Air France      [78, 66]        20045    OTTAWA  VANCOUVER
5        Lufthansa      [12, 33]        20055    LONDON   MONTREAL

In [13]:
df.tail()

0     Airline Code    DelayTimes  FlightCodes        To       From
1      Air Canada       [21, 40]        20015  WATERLOO    NEWYORK
2      Air France             []        20025  MONTREAL    TORONTO
3  Porter Airways   [60, 22, 87]        20035   CALGARY     OTTAWA
4       Air France      [78, 66]        20045    OTTAWA  VANCOUVER
5        Lufthansa      [12, 33]        20055    LONDON   MONTREAL